Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གང་རྣམས་རྒྱལ་བའི་སྟོབས་རྣམས་ཇི་བཞིན་རབ་ཞུགས་ཏེ། །ཐམས་ཅད་མཁྱེན་པའི་ཤུགས་དྲག་ཡངས་པ་རྣམ་སྤེལ་ཅིང་། གང་རྣམས་ཆོས་དབྱིངས་གཞི་ཚུལ་ཐ་དད་ཆགས་མེད་པ། །དེ་ནི་རྒྱལ་སྲས་རྣམས་ཀྱི་སྐྱེ་བ་བཅུ་ཡིན་ནོ། །
en: {9} “Those who have entered the strengths of the jinas, Who increase the vast powers of omniscience, Who are unattached to the various ways within the realm of phenomena— They are in the tenth birth of the sons of the jinas.

source: རིགས་ཀྱི་བུ་སྐྱེ་བ་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེའོ། །
en: {10} “Noble one, a bodhisattva is born into the family of the tathāgatas through those ten births.

source: དེ་ལྟར་ན་འཇིག་རྟེན་ཐམས་ཅད་ལ་སྣང་བར་བྱེད་པ་ཡིན་ནོ། །
en: In that way, the bodhisattva illuminates all worlds.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་ཐོབ་པའོ། །
en: “Noble one, I have attained the bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas.”

source: སྨྲས་པ། འཕགས་མ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བསྟན་པ་འདིའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana said, “Āryā, what is the scope of this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་ཡོངས་སུ་ལྟ་ཞིང་། ཉེ་བར་འགྲོ་བའི་སྨོན་ལམ་ཡོངས་སུ་གྲུབ་པ་སྟེ།
en: She answered, “Noble one, I fulfilled the prayer to see and approach the births of all bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐྱེ་བ་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པ་སྟེ།
en: “Noble one, I have comprehended the vast ocean of births of the Bhagavat Vairocana.

source: འདི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ཁོང་དུ་ཆུད་པར་བྱེད་ཅིང་།
en: Thus, I have observed his births as bodhisattvas in this world realm of a thousand million worlds.

source: གླིང་བཞི་པ་སྐུལ་བ་དང་ལྡན་པའི་འཛམ་བུའི་གླིང་དེའི་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བ་ཡོངས་སུ་བལྟ་བའི་དོན་དུ་སྔོན་གྱི་སྨོན་ལམ་གྱིས་སྐྱེས་ཏེ།
en: Because of my past prayer, I have been born in the Lumbinī Forest of Jambudvīpa, one of the four continents, in order to see the appearance of bodhisattvas.

source: ད་ལྟར་ཁོ་མོ་འདི་ན་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བའི་རྗེས་སུ་དྲན་པ་སྒོམ་ཞིང་རྣམ་པར་སྤྱོད་དོ། །
en: Now I am dwelling here, remembering and meditating on the births of bodhisattvas.

source: དེ་ལྟར་ཁོ་མོ་འདི་ན་གནས་གནས་ཏེ།
en: In that way, I remain here.

source: དེ་ཕན་ཆད་ལོ་བརྒྱ་ན་བཅོམ་ལྡན་འདས་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོ་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ།
en: After I had been dwelling here for a hundred years, the Bhagavat transmigrated from Tuṣita.

source: ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་སྔོན་གྱི་ལྟས་བཅུ་བྱུང་བར་གྱུར་ཏེ།
en: At that time, there were ten omens that appeared in the Lumbinī Forest.

source: འདི་ལྟར་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་མཐོན་དམན་མེད་ལ། ངམ་གྲོག་དང་། གཡང་ས་མེད་ཅིང་མཉམ་པར་གནས་པར་གྱུར་བ་འདི་ནི་སྔོན་གྱི་ལྟས་དང་པོ་བྱུང་བའོ། །
en: The first omen was that in this Lumbinī Forest everywhere became level without ravines or cliffs or high ground and low ground.

source: ཡང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་གསེག་མ་དང་། གྱོ་མོ་མེད་ལ་སྡོམ་དུམ་དང་ཚེར་མ་དང་བྲལ་ཏེ། སའི་གཞི་རྡོ་རྗེ་ལས་གྲུབ་པར་གྱུར་ནས། རིན་པོ་ཆེ་མང་པོས་ཡོངས་སུ་གང་བར་གནས་པར་གྱུར་པ་འདི་ནི་སྔོན་གྱི་ལྟས་གཉིས་པ་བྱུང་བའོ། །
en: The second omen was that throughout this Lumbinī Forest the ground became made of diamond, was free of pebbles, gravel, pieces of wood, and thorns, and was filled with many jewels.

source: ཡང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་དང་སཱ་ལ་དང་། ཏ་ལའི་ཕྲེང་བས་རྣམ་པར་འཁྲིགས་པས་ཡོངས་སུ་བརྒྱན་པར་ཀུན་ནས་གནས་པར་གྱུར་པ་འདི་ནི་སྔོན་གྱི་ལྟས་གསུམ་པ་བྱུང་བའོ། །
en: The third omen was that this entire Lumbinī Forest became a place thick with rows of precious trees, sal trees, and palm trees.

source: ཡང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་སྤོས་ཀྱི་མྱུ་གུ་ཀུན་ནས་འཐོན་པ་དང་། ཕྱེ་མ་ཐམས་ཅད་ཀྱི་མཛོད་ཀུན་ནས་འཐོན་པ་དང་། རྒྱལ་མཚན་ཐམས་ཅད་ཀྱི་སྤྲིན་དང་ན་བུན་ཡོངས་སུ་བྱུང་བ་དང་། སྤོས་ཀྱི་རིན་པོ་ཆེའི་གཟུགས་ཀྱི་ཤིང་དྲུང་ཀུན་འཁོར་ཏེ། རྒྱན་ཡོངས་སུ་སྦྱངས་པར་ཀུན་ནས་གནས་པར་གྱུར་པ་འདི་ནི་སྔོན་གྱི་ལྟས་བཞི་པ་བྱུང་བའོ། །
en: The fourth omen was that this entire Lumbinī Forest became a place in which grew aromatic seedlings that were superior to divine matter, in which appeared a treasure of all powders, in which arose clouds and mists of all banners, and which was adorned on every side by tree trunks formed of aromatic precious materials.

source: ཡང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། ལྷབ་ལྷུབ་སྣ་ཚོགས་ཀྱིས་མཛོད་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་རྒྱས་པ་དང་ལྡན་པར་ཀུན་ནས་གནས་པར་གྱུར་པ་འདི་ནི་སྔོན་གྱི་ལྟས་ལྔ་པ་བྱུང་བའོ། །
en: The fifth omen was that this entire Lumbinī Forest became a place where there appeared, spreading everywhere, a treasury of various flowers, garlands, and ornaments made of divine materials.

source: ཡང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་ཀྱི་ཤིང་ཐམས་ཅད་ལ་ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་མཛོད་མངོན་པར་གྲུབ་པར་གྱུར་བ་འདི་ནི་སྔོན་གྱི་ལས་དྲུག་པ་བྱུང་བའོ། །
en: The sixth omen was that throughout this Lumbinī Forest all the trees became treasures of excellent precious jewels.

source: ཡང་ལུམ་པི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་ཀྱི་པདྨོའི་ཚལ་ཐམས་ཅད་དུ་ཆ་ལས་སྐྱེས་པའི་མེ་ཏོག་ཐམས་ཅད་ཀྱང་ཁ་འབུས་ཏེ། སའི་གཞི་ལས་འཐོན་ནས། ཆུ་ལས་མངོན་པར་འཕགས་པར་གནས་པ་འདི་ནི་སྔོན་གྱི་ལྟས་བདུན་པ་བྱུང་བའོ། །ཡང་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་འདོད་པ་ལ་སྤྱོད་པ་དང་། གཟུགས་ལ་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའི་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: The seventh omen was that in all the lotus beds throughout this Lumbinī Forest, all the flowers that grew from water blossomed, rose up out of the ground, and floated above the water.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། འཇིག་རྟེན་གྱི་དབང་པོ་དང་། འགྲོ་བའི་དབང་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ན་ཐལ་མོ་སྦྱར་ཅིང་འཁོད་པར་གྱུར་ཏེ། འདི་ནི་སྔོན་གྱི་ལྟས་བརྒྱད་པ་བྱུང་བའོ། །ཡང་འཛམ་བུའི་གླིང་གི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ལྷའི་བུ་མོའམ། ཀླུའི་བུ་མོའམ། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: The eighth omen was that all the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, lords of the world, and lords of beings in this world’s desire realms and form realm gathered with their palms together in homage in this Lumbinī Forest.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་མཆོད་པའི་རྣམ་པ་ཐམས་ཅད་ལག་ན་ཐོགས་ཤིང་བླག་ཤའི་ཡལ་ག་ལ་མངོན་ཏུ་བལྟས་ཏེ། འདུད་ཅིང་ཕྱག་འཚལ་བར་འཁོད་པར་གྱུར་བ་འདི་ནི་སྔོན་གྱི་ལྟས་དགུ་པ་བྱུང་བའོ། །
en: The ninth omen was that all the female devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas in this world realm of Jambudvīpa gathered in this Lumbinī Forest joyfully, holding every kind of offering in their hands, gazing at the branches of the pippala tree, bowing down, and paying homage.

source: ཡང་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་ལྟེ་བའི་དཀྱིལ་འཁོར་དག་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་འོད་ཟེར་མང་པོ་འཐོན་ཏེ། ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཐམས་ཅད་སྣང་བར་བྱས་ནས་གནས་པར་གྱུར་ཏེ། འོད་ཟེར་གྱི་སྒོའི་དཀྱིལ་འཁོར་དེ་དག་ཐམས་ཅད་ལའང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་གཟུགས་བརྙན་དུ་གྱུར་པར་སྣང་བ་དང་།
en: The tenth omen was that many light rays called the lamps of the miraculous birth of the bodhisattva shone from the circle of the navels on the bodies of all the tathāgatas in the ten directions, and they illuminated and remained in this Lumbinī Forest.

source: ཐོག་མ་བལྟམ་པའི་རྣམ་པར་འཕྲུལ་བ་དང་བཅས་པར་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་གསུང་གི་དབྱངས་དང་ལྡན་པར་འོད་ཟེར་གྱི་སྒོའི་དཀྱིལ་འཁོར་དེ་དག་ལས་སྒྲར་འཐོན་ཅིང་གྲགས་པར་གྱུར་པ་འདི་ནི་སྔོན་གྱི་ལྟས་བཅུ་པ་བྱུང་བའོ། །
en: And all the qualities of the bodhisattvas, including their miraculous births, were heard emanating, with the sound of a buddha’s speech, from the circular tips of those light rays.”

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་དུས་ལ་བབ་པའི་ཚེ། སྔོན་གྱི་ལྟས་བཅུ་པོ་དེ་དག་བྱུང་བར་གྱུར་ཏེ།
en: “Those are the ten omens that appeared when the time came for the birth of the bodhisattvas.

source: དེ་བྱུང་བས་འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བར་ཤེས་སོ། །
en: When they appeared, all the lords of the world knew, ‘a bodhisattva is going to be born.’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་སྔོན་གྱི་ལྟས་བཅུ་པོ་དེ་དག་མཐོང་བས་ཀྱང་དགའ་བའི་ཤུགས་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་ཐོབ་བོ། །
en: “Noble one, in that way they gained an inconceivably powerful joy on seeing those ten omens.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ལྷ་མོ་སྒྱུ་མ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ནས་བྱུང་བའི་ཚེ། ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་སྔོན་གྱི་ལྟས་སྣང་བ་ཆེན་པོ་བཅུ་བྱུང་བར་གྱུར་ཏེ།
en: “Moreover, noble one, when Māyādevī came from the great city of Kapilavastu, ten great illuminating omens appeared in this Lumbinī Forest.

source: དེ་དག་བྱུང་བས་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཐམས་ཅད་མཁྱེན་པའི་ཆོས་ཀྱི་སྣང་བས་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་གྱུར་ཏོ། །
en: When they appeared, they increased within countless beings the power of joy in the light of the Dharma of omniscience.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What were those ten?

source: སའི་སྟེང་ན་གནས་པའི་རིན་པོ་ཆེའི་ཁང་བ་བརྩེགས་པ་ཐམས་ཅད་དུ་སྣང་བ་རབ་ཏུ་བྱུང་ངོ་། །
en: (1) All of the precious kūṭāgāras upon the surface of the earth shone.

source: རིན་པོ་ཆེའི་པདྨོ་ཁ་མ་བྱེ་བ་ཁ་འབྱེ་བར་གྱུར་པའི་འདབ་མ་ཐམས་ཅད་ལས་སྣང་བ་རབ་ཏུ་བྱུང་སྟེ།
en: (2) All the classes of aromatic flowers shone.

source: བལྟམ་པ་ལེགས་པར་བལྟམ་མོ་ཞེས་བྱ་བའི་སྒྲ་སྙན་པ་ཡང་དེ་དག་ལས་བྱུང་བར་གྱུར་ཏོ། །
en: (3) Light shone from all the petals of blossomed precious lotuses, and they emitted the sweet-sounding words: ‘The excellent birth has come to be.’

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཐོག་མ་སེམས་བསྐྱེད་པའི་སྣང་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་། ལུམ་པི་ནིའི་ནགས་ཚལ འདིར་སྣང་བར་བྱས་ཏེ་མངོན་པར་ཤར་ཏོ། །
en: (4) The illumination from all the first aspirations to enlightenment by bodhisattvas in the ten directions appeared in and illuminated this Lumbinī Forest.

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་གནོན་པའི་སྣང་བ་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་ངོ་། །
en: (5) The miraculous manifestation of illumination from the bodhisattvas ascending all the bhūmis appeared in and illuminated this Lumbinī Forest.

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་ཅིང་། ཡེ་ཤེས་ཁོང་དུ་ཆུད པའི་སྣང་བ་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་བར་གྱུར་ཏོ། །
en: (6) All the illumination from the light of the accomplishment of all the perfections and the realization of knowledge by the bodhisattvas in the ten directions appeared in and illuminated this Lumbinī Forest.

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྨོན་ལམ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བའི་ཡེ་ཤེས་སྣང་བའི་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་བར་གྱུར་ཏོ། །
en: (7) All the illumination from the knowledge of the bodhisattvas in the ten directions that has power over all prayers appeared in this Lumbinī Forest.

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྨོན་ལམ་རྒྱ་ཆེན་པོ་མངོན་པར་སྒྲུབ་པའི་ཡེ་ཤེས་སྣང་བའི་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་བར་གྱུར་ཏོ། །
en: (8) All the illumination from the knowledge of the bodhisattvas in the ten directions that accomplishes their vast prayers appeared in this Lumbinī Forest.

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱེད་པའི་ཡེ་ཤེས་སྣང་བའི་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་བར་གྱུར་ཏོ། །ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་གྱི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པའི་སྣང་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་བར་གྱུར་ཏོ། །
en: (9) All the illumination from the knowledge of the bodhisattvas in the ten directions that ripens and guides beings appeared in this Lumbinī Forest.

source: ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། སྐྱེ་བ་དང་མངོན་པར་འབྱུང་བ་དང་། བྱང་ཆུབ་ཏུ་རྣམ་བར་འཚང་རྒྱ་བ་དང་། ཡེ་ཤེས་ཐུགས་སུ་ཆུད་པར་མཛད་པའི་སྣང་བའི་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་བྱུང་བར་གྱུར་ཏོ། །
en: (10) All the illumination from the knowledge of the bodhisattvas in the ten directions that comprehends the miracles of all the buddhas, their setting forth, and their enlightenment at buddhahood appeared in this Lumbinī Forest.

source: སྔོན་གྱི་ལྟས་སྣང་བ་ཆེན་པོ་བཅུ་པོ་དེ་དག་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: Those ten great illuminating omens appeared.

source: དེ་དག་གིས་སེམས་ཅན་མཐའ་དང་དབུས་མྱེད་པའི་སེམས་དང་། བསམ་པའི་མུན་པ་ཐིབས་པོ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་སྣང་བར་བྱས་སོ། །རིགས་ཀྱི་བུ་དེ་ལ་ལྷ་མོ་སྒྱུ་མ་ཤིང་བླག་ཤའི་ནགས་སུ་ཕྱིན་པའི་ཚེ། འཇིག་རྟེན་གྱི་དབང་པོ་འདུས་པ་ཐམས་ཅད་དང་། འདོད་པའི་ཁམས་ཀྱི་ལྷའི་བུ་ལྷའི་བུའི་ཚོགས་དང་། ལྷའི་བུ་མོ་འཁོར་དང་བཅས་ཏེ་འདུས་པ་ཐམས་ཅད་དང་། གཟུགས་ལ་སྤྱོད་པའི་ལྷའི་བུ་དྲི་ང་བ་མེད་པ་ཐམས་ཅད་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: They illuminated the darkness of mind and thoughts in a vast number of beings without end or middle.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་འཁོར་དང་བཅས་ཏེ། ཚོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པར་བརྩོན་པ་ཐམས་ཅད་ཀྱི་ལུས་དང་། མཆོད་པའི་ཚོགས་ཐམས་ཅད་ཀྱང་ལྷ་མོ་སྒྱུ་མའི་གཟི་བརྗིད་དང་དཔལ་དང་ཁ་དོག་དང་གཟུགས་ཀྱིས་རབ་ཏུ་སྣང་བར་བྱས་སོ། །
en: “Noble one, when Māyādevī came to the pippala tree, all the gathered assemblies of the lords of the world, the devas of the desire realms with groups of apsarases and retinues of deva maidens, all the assembled devas of the form realms, who were free of odors, and the gatherings of nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and their retinues who were engaged in making offerings to the bodhisattvas had their bodies and their assembled offerings illuminated by Māyādevī’s brilliance, splendor, color, and form.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་འོད་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་མནན་ཏོ། །
en: All the lights that were in this world realm of a thousand million worlds were outshone and eclipsed.

source: ལྷ་མོ་སྒྱུ་མའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་བྱུང་བའི་འོད་དང་སྣང་བ་དག་ནི་འོད་གཞན་གྱིས་ཉམས་པར་གྱུར་བ་མེད། བསྒྲིབས་པར་གྱུར་པ་མེད། ཆོད་པར་གྱུར་པ་མྱེད། ཐོགས་པར་གྱུར་པ་མྱེད་དེ།
en: No other lights could affect, obscure, prevent, or impede the light and radiance that was emitted from all Māyādevī’s pores.

source: དེས་ཕྱོགས་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱས་ཏེ།
en: They filled all the directions and ended all the suffering of beings in the hells, all the suffering of beings in birth as an animal, all the suffering in the world of Yama, and all the suffering and kleśas of all beings within the various states of existence, and they remained illuminating, shining, and brilliant.

source: ལྷག་གེ་ལྷམ་མེ་ལྷང་ངེར་གནས་པར་གྱུར་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ། ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་དང་པོའོ། །
en: “Noble one, that was the first miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་གི་ཚེ་ལྷ་མོ་སྒྱུ་མའི་ལུས་སུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཆུད་ཅིང་གཟུགས་བརྙན་འབྱུང་བ་སྣང་བར་གྱུར་པ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱའི་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་རྒྱལ་པོའི་གནས་མིང་སྣ་ཚོགས་དང་ལྡན་པ་ཤ་སྟག་དང་།
en: “Moreover, noble one, at that time, there appeared situated within Māyādevī’s body the visual images of this world realm of a thousand million worlds.

source: ནགས་ཚལ་གྱི་མིང་སྣ་ཚོགས་དང་ལྡན་པ་ཤ་སྟག་དང་། ཤིང་དྲུང་རྣམ་པ་ཐ་དད་པ་ཤ་སྟག་ཏུའང་ལྷ་མོ་སྒྱུ་མ་ཕྱིན་ཅིང་། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ལ་སྟ་གོན་དུ་སྡོད་ཅིང་།
en: Within that world realm of a thousand million worlds, in all the Jambudvīpas in its thousand million four-continent worlds, in kingdoms with various names, in forests with various names, Māyādevī went to the foot of various kinds of trees, where she was encircled by all the lords of the worlds, waiting in preparation for the birth of the bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡུམ་གྱི་ཡེ་ཤེས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པས་རྣམ་པ་འདི་བཞིན་དུ་སྣང་བར་གྱུར་ཏེ།
en: This was through the inconceivable miraculous manifestation of the wisdom of the bodhisattva’s mother.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་གཉིས་པའོ། །
en: “Noble one, that was the second miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ལྷ་མོ་སྒྱུ་མའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ལ་ཡང་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངའ་བའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་ཏེ། རིམ་གྲོར་མཛད་པ་དང་། བསྟི་སྟང་དང་བཀུར་སྟིར་མཛད་དེ་མཆོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྣང་བར་གྱུར་ཏོ། །
en: “Moreover, noble one, there appeared within each opening of all Māyādevī’s pores all the tathāgatas that in the past were honored, worshiped, venerated, and offered to by the Bhagavat during his practice of bodhisattva conduct.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཆོས་ཇི་སྙེད་ཅིག་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བ་སྤུའི་བུ་ག་དེ་དག་ནས་སངས་རྒྱས་ཀྱི་གསུང་གི་ཡན་ལག་དང་ལྡན་པར་མ་ལུས་པར་གྲགས་པར་གྱུར་ཏེ། དཔེར་ན། ཆུའི་ཕོར་བུ་ཆུང་ངུ་འམ།
en: All the Dharma that those tathāgatas were teaching could be heard sounding from each pore with the aspects of a buddha’s speech.

source: བསེར་གྱི་རྡུལ་ཕྲ་མོའམ། མེ་ལོང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་གསལ་བའམ། ཆུ་ཤིན་ཏུ་དང་བ་ལ་ནམ་མཁའི་དཀྱིལ་འཁོར་གཉི་ཟླ་དང་། གཟའ་སྐར་གྱི་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་དང་། སྤྲིན་གྱི་ཚོགས་འབྲུག་སྒྲ་ཟབ་མོ་འབྱིན་པ་ཅན་ཡང་གཟུགས་བརྙན་དུ་གྱུར་པར་སྣང་ངོ་། །
en: It was like how the reflection of the display in the domain of the sky of the sun, moon, planets, and stars, and of clouds emitting the deep sound of thunder, appear in a small bowl of water, or a particle of gold, or the bright surface of a mirror, or on very clear water.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ལྷ་མོ་སྒྱུ་མའི་བ་སྤུའི་སྒོའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལའང་། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་རྣམས་ཀྱང་ཡོངས་སུ་སྣང་། ཆོས་བསྟན་པའི་སྒྲ་ཐམས་ཅད་ཀྱང་གྲགས་པར་གྱུར་ཏེ།
en: “Noble one, in that way, the miraculous manifestations of the past tathāgatas appeared and the sound of all their Dharma teachings sounded within the openings of all Māyādevī’s pores.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་གསུམ་པའོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་ལྷ་མོ་སྒྱུ་མའི་ལུས་ཐམས་ཅད་དང་།
en: “Noble one, that was the third miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: བ་སྤུའི་སྒོའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་ཞིང་ཇི་སྙེད་ཅིག་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཇི་སྙེད་ཅིག་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཇི་སྙེད་ཅིག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཇི་སྙེད་ཅིག་དང་། འཇིག་རྟེན་ཁམས་ཀྱི་མིང་དུ་བྱ་བ་ཇི་སྙེད་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་དེ། ཞིང་གི་གཞི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དང་། དབྱིབས་ནི་ཅི་འདྲ་བ་དང་། རྒྱན་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དང་། ལྷུན་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དང་། རིའི་རྒྱན་ནི་ཇི་ལྟ་བུ་དག་ཅིག་ཡོད་པར་གྱུར་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་།
en: “Moreover, noble one, from Māyādevī’s entire body and from each opening of all her pores appeared all the realms, the entire ocean of world realms, the entire vast extent of world realms, the entire multitude of world realms, and all that are called world realms in which the Bhagavat practiced bodhisattva conduct in the past.

source: ཡུལ་དང་། ལྗོངས་དང་། གྲོང་རྡལ་གྱི་རྒྱན་ནི་ཇི་ལྟ་བུ་དག་ཅིག་གནས་གནས་པ་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། མཚོ་དང་། ལུ་མ་དང་། རྒྱ་མཚོའི་རྒྱན་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དང་། ནམ་མཁའ་དང་སྤྲིན་གྱི་རྒྱན་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དང་། སེམས་ཅན་གྱི་གནས་ནི་ཇི་ལྟ་བུ་ཞིག་ཡོད་པར་གྱུར་པ་དང་། ཐེག་པ་བསྟན་པ་ནི་གང་དང་ཡང་ལྡན་པར་གྱུར་པ་དང་། བསྐལ་པའི་མྱིང་དང་གྲངས་ཇི་སྙེད་ཅིག་ཅེས་བྱ་བར་གྱུར་པ་དང་། སངས་རྒྱས་སྐྱེ་བ་ནི་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དང་། རྣམ་པར་དག་པ་ནི་གང་དུ་འདུ་བར་གྱུར་པ་དང་། སེམས་ཅན་གྱི་ཚེའི་ཚད་ནི་ཇི་ཙམ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དང་། འཇིག་རྟེན་གྱི་སྐྱེ་གནས་ནི་གང་དུ་སྐྱེས་པར་གྱུར་པ་དང་། སེམས་ཅན་ཇི་ལྟ་བུ་ཞིག་དང་འགྲོགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ནི་ཇི་ལྟ་བུ་ཞིག་ལ་བརྟེན་བརྟེན་པ་དང་། དགེ་བའི་ཆོས་ནི་ཇི་ལྟ་བུ་ཞིག་ལ་བརྩོན་པར་སྤྱོད་སྤྱོད་པ་དང་། ཆོས་ཀྱི་ནན་ཏན་ནི་ཇི་ལྟ་བུ་ཞིག་ལ་བརྩོན་པར་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱོད་སྤྱོད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྣང་བར་གྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱིར་མྱི་ལྡོག་པའི་གནས་བརྙེས་ནས། སྡོན་སྐུ་ནི་ཇི་སྙེད་ཅིག །རྣམ་པར་སྤྱོད་པ་ཇི་ལྟ་བུ་ཞིག །
en: There appeared the surface of the realms; their shapes; their arrangement; their bulks; their adorning mountains; their adorning villages, towns, regions, lands, and cities; their adorning parks, rivers, lakes, ponds, and seas; their adorning skies and clouds; their abodes of beings; the yānas that were taught there; the numbers and names of their kalpas; their births of buddhas; their perfect purities; the lifespans of beings; their rebirths into worlds; the communities of beings; the dependence on kalyāṇamitras; the dedication to virtuous qualities; the engagement in the practice of the Dharma; and the practice of bodhisattva conduct in buddha realms.

source: ཆ་བྱད་ནི་ཇི་ལྟ་བུ་ཞིག །ལོངས་སུ་སྤྱོད་པ་ནི་ཅི་དང་ལྡན། བདེ་བ་དང་སྡུག་བསྔལ་ནི་ཇི་ལྟ་བུ་ཞིག་སྐུ་ཉམས་སུ་བཞེས། སྐུ་ཚེའི་རྒྱུད་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་ཏེ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ཡོངས་སུ་སྣང་བར་གྱུར་ཏོ། །
en: In all the pores there appeared all the Bhagavat’s attainment of the state of irreversibility, his previous bodies, his conduct, his appearance, what possessions he had, what happiness and unhappiness he experienced, and his lifespans.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱི་སྐྱེ་གནས་དེ་དང་། དེ་དག་ཏུ་ལྷ་མོ་སྒྱུ་མ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐུ་དེ་དག་ཐམས་ཅད་ཀྱང་། ལྷ་མོ་སྒྱུ་མའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་དུ་རྣམ་པར་འཕྲུལ་པའི་གཟུགས་བརྙན་བྱུང་བར་གྱུར་ཏེ།
en: There appeared in all the pores of Māyādevī’s body images of the various births in all those buddha realms, Māyādevī as the mothers of the bodhisattvas, and all those bodies of the bodhisattvas.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ། ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་བཞི་པའོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྔོན་སྐུ་ནི་ཇི་སྙེད་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པ་དང་། ཁ་དོག་ནི་ཇི་ལྟ་བུ་ཞིག་དབྱིབས་ནི་ཅི་འདྲ་བ་ཞིག །
en: “Noble one, that was the fourth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: ཆ་བྱད་ནི་ཇི་ལྟ་བུ་ཞིག །ད་རོད་ནི་ཇི་ལྟ་བུ་ཞིག །ལོངས་སྤྱོད་ནི་ཅི་དང་ལྡན། བདེ་བ་དང་སྡུག་བསྔལ་ནི་ཇི་ལྟ་བུ་ཞིག་སྐུ་ཉམས་སུ་བཞེས། སྐུ་ཚེའི་རྒྱུད་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷ་མོ་སྒྱུ་མའི་ལུས་ཀྱི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ལས་གཟུགས་བརྙན་དུ་སྣང་བར་གྱུར་ཏེ།
en: “Moreover, noble one, there appeared in all the pores of Māyādevī’s body images of the past bodies in which the Bhagavat practiced bodhisattva conduct, their colors, their shapes, their appearances, their forms, their possessions, their happiness and sufferings, and their lifespans.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་ལྔ་པའོ། །
en: “Noble one, that was the fifth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.
